# Key Data structure in python
- `series`
- `dataframe`

In [1]:
# %pip install pandas
import pandas as pd

In [2]:
series=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(series)
type(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

pandas.core.series.Series

## Encoding Technique used in craeting datasets
- `.latin1`
- `utf-8`


- There are three different methods to read different types of files in Python:

    1. `pd.read_csv()` – for CSV files  
        - pd.read_csv(source,encoding=utf-8) function is used to read a comma-separated values (CSV) file into a DataFrame.
    2. `pd.read_excel()` – for Excel files  
    3. `pd.read_json()` – for JSON files

In [3]:
df= pd.read_csv("./sources/employee_data.csv")
df

      Name    Age      Salary Department  Experience
0     Amit   31.0     -5699.0    Finance         NaN
1    Arjun    NaN  10000000.0    Finance         NaN
2     Neha    NaN  10000000.0         HR         3.0
3     John  200.0  10000000.0         HR        14.0
4    Priya   37.0         NaN         HR         NaN
..     ...    ...         ...        ...         ...
175   Neha   56.0  10000000.0    Support         NaN
176   Amit   38.0         NaN      Admin         1.0
177    Sam    NaN     75311.0      Sales         7.0
178    Tom    NaN  10000000.0         HR        18.0
179  Priya  200.0         inf         IT         NaN

[180 rows x 5 columns]

In [4]:
df.head()#by default 5 rows ,returns matrix of head(number)

    Name    Age      Salary Department  Experience
0   Amit   31.0     -5699.0    Finance         NaN
1  Arjun    NaN  10000000.0    Finance         NaN
2   Neha    NaN  10000000.0         HR         3.0
3   John  200.0  10000000.0         HR        14.0
4  Priya   37.0         NaN         HR         NaN

In [5]:
df.tail()#by default 5 rows ,returns matrix of tail(number)

      Name    Age      Salary Department  Experience
175   Neha   56.0  10000000.0    Support         NaN
176   Amit   38.0         NaN      Admin         1.0
177    Sam    NaN     75311.0      Sales         7.0
178    Tom    NaN  10000000.0         HR        18.0
179  Priya  200.0         inf         IT         NaN

In [6]:
df.describe()
#error occured due to missing values in the dataset

d:\website\rex\programs\PYTHON\12_numpy_pandas\venv\Lib\site-packages\pandas\core\nanops.py:1016: RuntimeWarning: invalid value encountered in subtract
  sqr = _ensure_numeric((avg - values) ** 2)

             Age      Salary  Experience
count  115.00000       140.0   85.000000
mean   109.20000         inf   10.211765
std     81.86823         NaN    6.453301
min     20.00000    -38394.0    0.000000
25%     33.00000     38611.5    5.000000
50%     55.00000     84762.0    9.000000
75%    200.00000  10000000.0   17.000000
max    200.00000         inf   20.000000

## Data selection

In [7]:
df[["Name","Age","Salary"]]

      Name    Age      Salary
0     Amit   31.0     -5699.0
1    Arjun    NaN  10000000.0
2     Neha    NaN  10000000.0
3     John  200.0  10000000.0
4    Priya   37.0         NaN
..     ...    ...         ...
175   Neha   56.0  10000000.0
176   Amit   38.0         NaN
177    Sam    NaN     75311.0
178    Tom    NaN  10000000.0
179  Priya  200.0         inf

[180 rows x 3 columns]

## Missing value in each columns :-

In [8]:
print(pd.isnull(df).sum())

Name           0
Age           65
Salary        40
Department     0
Experience    95
dtype: int64

## Removing missing values:-

In [9]:
df.dropna()

      Name    Age      Salary Department  Experience
3     John  200.0  10000000.0         HR        14.0
5     Riya   24.0     47189.0         HR        10.0
6     Riya  200.0         inf    Finance        18.0
8    Arjun   46.0    -14398.0    Support        14.0
11    John  200.0     62542.0      Sales        11.0
18    Sara  200.0  10000000.0         HR         5.0
22    Riya  200.0         inf         HR        16.0
31   Priya   28.0     59546.0         HR        20.0
35    Amit  200.0    -17032.0      Sales        18.0
36    Sara   34.0  10000000.0         HR         7.0
39   Priya  200.0    -25982.0    Support         9.0
46    Amit   20.0    -14505.0    Finance         2.0
48    John   44.0         inf    Support         9.0
58     Tom   40.0     67268.0    Support         0.0
62   Karan   22.0    -33031.0      Sales         0.0
64     Tom   32.0     50607.0      Admin         1.0
66     Sam   36.0         inf      Sales         5.0
84   Arjun   55.0  10000000.0         HR        18.0
88    Riya  200.0     31479.0         HR         8.0
89   Priya  200.0    -31698.0    Support         7.0
90   Karan   30.0     57847.0    Support        18.0
95    Amit  200.0     64602.0    Support         3.0
97   Arjun  200.0         inf    Finance        20.0
99    Neha   40.0    -10773.0    Finance        20.0
109   Riya  200.0    -17828.0         IT        11.0
119    Sam  200.0    -29408.0    Support         3.0
124  Karan   44.0    -11594.0    Support         5.0
127    Sam  200.0  10000000.0      Sales         3.0
140   Amit  200.0         inf    Support         5.0
142  Priya   31.0  10000000.0         IT        12.0
146   John  200.0     38846.0    Support        15.0
148    Tom   21.0  10000000.0         HR         1.0
153    Tom   28.0  10000000.0         IT        10.0
156    Tom  200.0    -10634.0    Support        18.0
160  Arjun  200.0         inf    Finance        20.0
163  Karan   30.0     57847.0    Support        18.0
172   Amit   20.0    -14505.0    Finance         2.0

## Filling missing values with a constant
- syntax 
   - ` df.fillna(value)`
   - ` df.fillna(value, inplace=True)`- inplace inside any pandas fn can change the value in the original dataframe

In [10]:
df.fillna(0)

      Name    Age      Salary Department  Experience
0     Amit   31.0     -5699.0    Finance         0.0
1    Arjun    0.0  10000000.0    Finance         0.0
2     Neha    0.0  10000000.0         HR         3.0
3     John  200.0  10000000.0         HR        14.0
4    Priya   37.0         0.0         HR         0.0
..     ...    ...         ...        ...         ...
175   Neha   56.0  10000000.0    Support         0.0
176   Amit   38.0         0.0      Admin         1.0
177    Sam    0.0     75311.0      Sales         7.0
178    Tom    0.0  10000000.0         HR        18.0
179  Priya  200.0         inf         IT         0.0

[180 rows x 5 columns]

In [11]:
df.keys()

Index(['Name', 'Age', 'Salary', 'Department', 'Experience'], dtype='object')

## Particular column
- Syntax: `df.loc[condition,[['col1',...]]` -

In [12]:
df.loc[(df["Name"] == 'Neha') & (df['Age'] == 60), ['Salary', 'Department']]

     Salary Department
157     NaN      Sales

## Renamimg columns:-
- Syntax: `df.rename(columns={'old_name': 'new_name'})` 
- return a new data frame

In [13]:
df.rename(columns={'Employee_ID': 'Emp_id', 'Employee_Name': 'Emp_name'})

      Name    Age      Salary Department  Experience
0     Amit   31.0     -5699.0    Finance         NaN
1    Arjun    NaN  10000000.0    Finance         NaN
2     Neha    NaN  10000000.0         HR         3.0
3     John  200.0  10000000.0         HR        14.0
4    Priya   37.0         NaN         HR         NaN
..     ...    ...         ...        ...         ...
175   Neha   56.0  10000000.0    Support         NaN
176   Amit   38.0         NaN      Admin         1.0
177    Sam    NaN     75311.0      Sales         7.0
178    Tom    NaN  10000000.0         HR        18.0
179  Priya  200.0         inf         IT         NaN

[180 rows x 5 columns]

##  Changing Dtype:-

In [14]:

df2 = pd.DataFrame({
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
})

df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   salary  6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [15]:

df2=df2.astype({'salary': float})
df2

      name   salary
0    Piper   4548.0
1    Grace  28150.0
2  Georgia   1103.0
3   Willow   6593.0
4     Finn  74576.0
5   Thomas  24433.0

# Adding and removing columns

In [16]:
df["new_column"]=[5000 for i in range(len(df))]
#  employees["bonus"]=[employees['salary']*2 for i in range(len(employees))]
df["bonus"] = df['Salary'] * 2
df

      Name    Age      Salary Department  Experience  new_column       bonus
0     Amit   31.0     -5699.0    Finance         NaN        5000    -11398.0
1    Arjun    NaN  10000000.0    Finance         NaN        5000  20000000.0
2     Neha    NaN  10000000.0         HR         3.0        5000  20000000.0
3     John  200.0  10000000.0         HR        14.0        5000  20000000.0
4    Priya   37.0         NaN         HR         NaN        5000         NaN
..     ...    ...         ...        ...         ...         ...         ...
175   Neha   56.0  10000000.0    Support         NaN        5000  20000000.0
176   Amit   38.0         NaN      Admin         1.0        5000         NaN
177    Sam    NaN     75311.0      Sales         7.0        5000    150622.0
178    Tom    NaN  10000000.0         HR        18.0        5000  20000000.0
179  Priya  200.0         inf         IT         NaN        5000         inf

[180 rows x 7 columns]

### New col using fn

In [17]:
def fx(x):
    return x//5000
df['div-Salary']=df['Salary'].apply(fx)
df[['Salary','new_column','div-Salary']]

         Salary  new_column  div-Salary
0       -5699.0        5000        -2.0
1    10000000.0        5000      2000.0
2    10000000.0        5000      2000.0
3    10000000.0        5000      2000.0
4           NaN        5000         NaN
..          ...         ...         ...
175  10000000.0        5000      2000.0
176         NaN        5000         NaN
177     75311.0        5000        15.0
178  10000000.0        5000      2000.0
179         inf        5000         NaN

[180 rows x 3 columns]

## Saving the DataFrame to a  file
- `df.to_csv(`'data.csv', index=False`)`
    - `index=True`- saves the DataFrame with the index column
    - `index=False`- By default,saves the DataFrame without the index column

- `df.to_json('data.json', index=False)`

- `df.to_excel('data.xlsx', index=False)`

In [18]:
new_df=df.fillna(0).head()
new_df.to_csv('newdf.csv',index=False)

### RESHAPING table
- `using pivot()`
- `using melt()`

In [19]:
import pandas as pd

data = [
    {"city": "Jacksonville", "month": "January",  "temperature": 13},
    {"city": "Jacksonville", "month": "February", "temperature": 23},
    {"city": "Jacksonville", "month": "March",    "temperature": 38},
    {"city": "Jacksonville", "month": "April",    "temperature": 5},
    {"city": "Jacksonville", "month": "May",      "temperature": 34},
    {"city": "ElPaso",       "month": "January",  "temperature": 20},
    {"city": "ElPaso",       "month": "February", "temperature": 6},
    {"city": "ElPaso",       "month": "March",    "temperature": 26},
    {"city": "ElPaso",       "month": "April",    "temperature": 2},
    {"city": "ElPaso",       "month": "May",      "temperature": 43},
]

weather = pd.DataFrame(data)
print(weather)

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [20]:
pivot_table = weather.pivot(index='month',columns='city',values='temperature')
print(pivot_table)

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

### Concat two DataFrames

In [21]:
df1=pd.DataFrame({
    'Name':["Akash",'Priysnka','Rahul'],
'Marks':[4,5,6]})

df2=pd.DataFrame({
    'Name':["Akash",'Priysnka','Rahul'],
'Roll No':[4234,2345,654]})

pd.concat([df1,df2])

       Name  Marks  Roll No
0     Akash    4.0      NaN
1  Priysnka    5.0      NaN
2     Rahul    6.0      NaN
0     Akash    NaN   4234.0
1  Priysnka    NaN   2345.0
2     Rahul    NaN    654.0

### Merging two df
- `on='Col-Name'` 
    - merging two df on Col-Name column 
    - return only duplicate rows

In [22]:
pd.merge(df1,df2,on='Name')

       Name  Marks  Roll No
0     Akash      4     4234
1  Priysnka      5     2345
2     Rahul      6      654